---
kind: property
id: P:Autodesk.Revit.DB.ImageType.HeightInPixels
source: html/ec9625b0-d4d4-0430-4407-3d3f56f4ce0f.htm
---
# Autodesk.Revit.DB.ImageType.HeightInPixels Property

Number of pixels in the vertical direction of the image

## Syntax (C#)
```csharp
public int HeightInPixels { get; }
```